'''
Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает,
Вам стоит написать программу.
Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе
стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов,
то они разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение
Винни-Пух вбивает в программу с клавиатуры. В ответе напишите:
“Парам пам-пам” - если с ритмом все в порядке
“Пам парам” - если с ритмом все НЕ в порядке

Пример:
Ввод: пара-ра-рам рам-пам-папам па-ра-па-да    
    **Вывод:** Парам пам-пам  
'''
def task34():
  from functools import reduce
  letters = {'у','е','ы','а','о','э','я','и','ю'} # создается словарь букв, подлежащих проверке

  def determining_rhythm (use_list):
      use_list = use_list.lower().split()
      use_dict = set()
      use_def = None
      for i in use_list:
          use_def = len(list(filter(lambda x:True if x in letters else False,i))) # рассчитывается длина гласных в каждом слове
          use_dict.add(use_def)                   # длина присваивается множеству, там где хранятся исключительные значения 
          if len(use_dict) > 1:                   # как только длина множества > 1 - означает, что есть слово, которое содержит другой размер гласных
            return print("Пам парам")             # нас выбрасывает из дальнейшей проверки и даёт результат
      return print("Парам пам-пам")               # если не выбросило ранее из кода, значит с ритмом все ОК))
          
  use_str = input("Введите свою кричалку: ")
  determining_rhythm (use_str)

'''
Задача 36: Напишите функцию print_operation_table(operation, num_rows=6, num_columns=6),
которая принимает в качестве аргумента функцию, вычисляющую элемент по номеру строки и столбца.
Аргументы num_rows и num_columns указывают число строк и столбцов таблицы, которые должны быть распечатаны.
Нумерация строк и столбцов идет с единицы (подумайте, почему не с нуля).
Примечание: бинарной операцией называется любая операция, у которой ровно два аргумента, как,
например, у операции умножения.

Пример:
Ввод: `print_operation_table(lambda x, y: x * y) ` 
Вывод:
1 2  3  4  5  6
2 4  6  8  10 12
3 6  9  12 15 18
4 8  12 16 20 24
5 10 15 20 25 30
6 12 18 24 30 36
'''
def task36():
  def print_operation_table(operation, num_rows=6, num_columns=6):
    print(*[i+1 for i in range(num_columns)])
    for i in range(2, num_rows+1):
        print (*[i if j == 1 else operation(j,i) for j in range(1, num_columns+1)])
    
  print_operation_table(lambda x,y:x+y)

task34()
task36()